RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_lptim.h
/**
  ******************************************************************************
  * @file    stm32h7rsxx_hal_lptim.h
  * @author  MCD Application Team
  * @brief   Header file of LPTIM HAL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32H7RSxx_HAL_LPTIM_H
#define STM32H7RSxx_HAL_LPTIM_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7rsxx_hal_def.h"

/* Include low level driver */
#include "stm32h7rsxx_ll_lptim.h"

/** @addtogroup STM32H7RSxx_HAL_Driver
  * @{
  */

#if defined (LPTIM1) || defined (LPTIM2) || defined (LPTIM3) || defined (LPTIM4) || defined (LPTIM5)

/** @addtogroup LPTIM
  * @{
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup LPTIM_Exported_Types LPTIM Exported Types
  * @{
  */
#define LPTIM_EXTI_LINE_LPTIM1  EXTI_IMR2_IM47  /*!< External interrupt line 47 Connected to the LPTIM1 EXTI Line */
#define LPTIM_EXTI_LINE_LPTIM2  EXTI_IMR2_IM48  /*!< External interrupt line 48 Connected to the LPTIM2 EXTI Line */
#define LPTIM_EXTI_LINE_LPTIM3  EXTI_IMR2_IM50  /*!< External interrupt line 50 Connected to the LPTIM3 EXTI Line */
#define LPTIM_EXTI_LINE_LPTIM4  EXTI_IMR2_IM52  /*!< External interrupt line 52 Connected to the LPTIM4 EXTI Line */
#define LPTIM_EXTI_LINE_LPTIM5  EXTI_IMR2_IM53  /*!< External interrupt line 53 Connected to the LPTIM5 EXTI Line */

/**
  * @brief  LPTIM Clock configuration definition
  */
typedef struct
{
  uint32_t Source;         /*!< Selects the clock source.
                           This parameter can be a value of @ref LPTIM_Clock_Source   */

  uint32_t Prescaler;      /*!< Specifies the counter clock Prescaler.
                           This parameter can be a value of @ref LPTIM_Clock_Prescaler */

} LPTIM_ClockConfigTypeDef;

/**
  * @brief  LPTIM Clock configuration definition
  */
typedef struct
{
  uint32_t Polarity;      /*!< Selects the polarity of the active edge for the counter unit
                           if the ULPTIM input is selected.
                           Note: This parameter is used only when Ultra low power clock source is used.
                           Note: If the polarity is configured on 'both edges', an auxiliary clock
                           (one of the Low power oscillator) must be active.
                           This parameter can be a value of @ref LPTIM_Clock_Polarity */

  uint32_t SampleTime;     /*!< Selects the clock sampling time to configure the clock glitch filter.
                           Note: This parameter is used only when Ultra low power clock source is used.
                           This parameter can be a value of @ref LPTIM_Clock_Sample_Time */

} LPTIM_ULPClockConfigTypeDef;

/**
  * @brief  LPTIM Trigger configuration definition
  */
typedef struct
{
  uint32_t Source;        /*!< Selects the Trigger source.
                          This parameter can be a value of @ref LPTIM_Trigger_Source */

  uint32_t ActiveEdge;    /*!< Selects the Trigger active edge.
                          Note: This parameter is used only when an external trigger is used.
                          This parameter can be a value of @ref LPTIM_External_Trigger_Polarity */

  uint32_t SampleTime;    /*!< Selects the trigger sampling time to configure the clock glitch filter.
                          Note: This parameter is used only when an external trigger is used.
                          This parameter can be a value of @ref LPTIM_Trigger_Sample_Time  */
} LPTIM_TriggerConfigTypeDef;

/**
  * @brief  LPTIM Initialization Structure definition
  */
typedef struct
{
  LPTIM_ClockConfigTypeDef     Clock;             /*!< Specifies the clock parameters */

  LPTIM_ULPClockConfigTypeDef  UltraLowPowerClock;/*!< Specifies the Ultra Low Power clock parameters */

  LPTIM_TriggerConfigTypeDef   Trigger;           /*!< Specifies the Trigger parameters */

  uint32_t                     Period;            /*!< Specifies the period value to be loaded into the active
                                                  Auto-Reload Register at the next update event.
                                                  This parameter can be a number between
                                                  Min_Data = 0x0001 and Max_Data = 0xFFFF.  */

  uint32_t                     UpdateMode;        /*!< Specifies whether the update of the autoreload and the compare
                                                  values is done immediately or after the end of current period.
                                                  This parameter can be a value of @ref LPTIM_Updating_Mode */

  uint32_t                     CounterSource;     /*!< Specifies whether the counter is incremented each internal event
                                                  or each external event.
                                                  This parameter can be a value of @ref LPTIM_Counter_Source */

  uint32_t                     Input1Source;      /*!< Specifies source selected for input1 (GPIO or comparator output).
                                                  This parameter can be a value of @ref LPTIM_Input1_Source */

  uint32_t                     Input2Source;      /*!< Specifies source selected for input2 (GPIO or comparator output).
                                                  Note: This parameter is used only for encoder feature so is used only
                                                  for LPTIM1 instance.
                                                  This parameter can be a value of @ref LPTIM_Input2_Source */

  uint32_t                     RepetitionCounter;/*!< Specifies the repetition counter value.
                                                  Each time the RCR downcounter reaches zero, an update event is
                                                  generated and counting restarts from the RCR value (N).
                                                  Note: When using repetition counter the UpdateMode field must be
                                                        set to LPTIM_UPDATE_ENDOFPERIOD otherwise unpredictable
                                                        behavior may occur.
                                                  This parameter must be a number between Min_Data = 0x00 and
                                                  Max_Data = 0xFF. */
} LPTIM_InitTypeDef;

/**
  * @brief  LPTIM Output Compare Configuration Structure definition
  */
typedef struct
{
  uint32_t Pulse;                 /*!< Specifies the pulse value to be loaded into the Capture Compare Register.
                                       This parameter can be a number between Min_Data = 0x0000 and Max_Data = 0xFFFF */
  uint32_t OCPolarity;            /*!< Specifies the output polarity.
                                       This parameter can be a value of @ref LPTIM_Output_Compare_Polarity */
} LPTIM_OC_ConfigTypeDef;

/**
  * @brief  LPTIM Input Capture Configuration Structure definition
  */
typedef struct
{
  uint32_t ICInputSource; /*!< Specifies source selected for IC channel.
                               This parameter can be a value of @ref LPTIM_Input_Capture_Source */

  uint32_t ICPrescaler;   /*!< Specifies the Input Capture Prescaler.
                               This parameter can be a value of @ref LPTIM_Input_Capture_Prescaler */

  uint32_t ICPolarity;    /*!< Specifies the active edge of the input signal.
                               This parameter can be a value of @ref LPTIM_Input_Capture_Polarity */

