RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_lptim.h
/** @brief  Disable the specified DMA request.
  * @param  __HANDLE__ specifies the LPTIM Handle.
  * @param  __DMA__ specifies the LPTIM DMA request to disable.
  *          This parameter can be one of the following values:
  *            @arg LPTIM_DMA_UPDATE: Update DMA request
  *            @arg LPTIM_DMA_CC1:   Capture/Compare 1 DMA request
  *            @arg LPTIM_DMA_CC2:   Capture/Compare 2 DMA request
  * @retval None
  */
#define __HAL_LPTIM_DISABLE_DMA(__HANDLE__, __DMA__)        ((__HANDLE__)->Instance->DIER &= ~(__DMA__))

/**
  * @brief  Check whether the specified LPTIM interrupt source is enabled or not.
  * @param  __HANDLE__ LPTIM handle.
  * @param  __INTERRUPT__ LPTIM interrupt to check.
  *            This parameter can be a value of:
  *            @arg LPTIM_IT_REPOK   : Repetition register update OK Interrupt.
  *            @arg LPTIM_IT_UPDATE  : Update event register Interrupt.
  *            @arg LPTIM_IT_DOWN    : Counter direction change up Interrupt.
  *            @arg LPTIM_IT_UP      : Counter direction change down to up Interrupt.
  *            @arg LPTIM_IT_ARROK   : Autoreload register update OK Interrupt.
  *            @arg LPTIM_IT_CMP1OK  : Compare register 1 update OK Interrupt.
  *            @arg LPTIM_IT_CMP2OK  : Compare register 2 update OK Interrupt.
  *            @arg LPTIM_IT_EXTTRIG : External trigger edge event Interrupt.
  *            @arg LPTIM_IT_ARRM    : Autoreload match Interrupt.
  *            @arg LPTIM_IT_CC1     : Capture/Compare 1 interrupt Interrupt.
  *            @arg LPTIM_IT_CC2     : Capture/Compare 2 interrupt Interrupt.
  *            @arg LPTIM_IT_CC1O    : Capture/Compare 1 over-capture Interrupt.
  *            @arg LPTIM_IT_CC2O    : Capture/Compare 2 over-capture Interrupt.
  * @retval Interrupt status.
  */

#define __HAL_LPTIM_GET_IT_SOURCE(__HANDLE__, __INTERRUPT__) ((((__HANDLE__)->Instance->DIER\
                                                                & (__INTERRUPT__)) == (__INTERRUPT__)) ? SET : RESET)

/**
  * @brief  Enable the LPTIM1 EXTI line in interrupt mode.
  * @retval None
  */
#define __HAL_LPTIM_LPTIM1_EXTI_ENABLE_IT()            (EXTI->IMR2 |= LPTIM_EXTI_LINE_LPTIM1)

/**
  * @brief  Disable the LPTIM1 EXTI line in interrupt mode.
  * @retval None
  */
#define __HAL_LPTIM_LPTIM1_EXTI_DISABLE_IT()           (EXTI->IMR2\
                                                        &= ~(LPTIM_EXTI_LINE_LPTIM1))

/**
  * @brief  Enable the LPTIM2 EXTI line in interrupt mode.
  * @retval None
  */
#define __HAL_LPTIM_LPTIM2_EXTI_ENABLE_IT()            (EXTI->IMR2 |= LPTIM_EXTI_LINE_LPTIM2)

/**
  * @brief  Disable the LPTIM2 EXTI line in interrupt mode.
  * @retval None
  */
#define __HAL_LPTIM_LPTIM2_EXTI_DISABLE_IT()           (EXTI->IMR2\
                                                        &= ~(LPTIM_EXTI_LINE_LPTIM2))

/**
  * @brief  Enable the LPTIM3 EXTI line in interrupt mode.
  * @retval None
  */
#define __HAL_LPTIM_LPTIM3_EXTI_ENABLE_IT()            (EXTI->IMR2 |= LPTIM_EXTI_LINE_LPTIM3)

/**
  * @brief  Disable the LPTIM3 EXTI line in interrupt mode.
  * @retval None
  */
#define __HAL_LPTIM_LPTIM3_EXTI_DISABLE_IT()           (EXTI->IMR2\
                                                        &= ~(LPTIM_EXTI_LINE_LPTIM3))

/**
  * @brief  Enable the LPTIM4 EXTI line in interrupt mode.
  * @retval None
  */
#define __HAL_LPTIM_LPTIM4_EXTI_ENABLE_IT()            (EXTI->IMR2 |= LPTIM_EXTI_LINE_LPTIM4)

/**
  * @brief  Disable the LPTIM4 EXTI line in interrupt mode.
  * @retval None
  */
#define __HAL_LPTIM_LPTIM4_EXTI_DISABLE_IT()           (EXTI->IMR2\
                                                        &= ~(LPTIM_EXTI_LINE_LPTIM4))

/**
  * @brief  Enable the LPTIM5 EXTI line in interrupt mode.
  * @retval None
  */
#define __HAL_LPTIM_LPTIM5_EXTI_ENABLE_IT()            (EXTI->IMR2 |= LPTIM_EXTI_LINE_LPTIM5)

/**
  * @brief  Disable the LPTIM5 EXTI line in interrupt mode.
  * @retval None
  */
#define __HAL_LPTIM_LPTIM5_EXTI_DISABLE_IT()           (EXTI->IMR2\
                                                        &= ~(LPTIM_EXTI_LINE_LPTIM5))

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup LPTIM_Exported_Functions LPTIM Exported Functions
  * @{
  */

/** @addtogroup LPTIM_Exported_Functions_Group1
  *  @brief    Initialization and Configuration functions.
  * @{
  */
/* Initialization/de-initialization functions  ********************************/
HAL_StatusTypeDef HAL_LPTIM_Init(LPTIM_HandleTypeDef *hlptim);
HAL_StatusTypeDef HAL_LPTIM_DeInit(LPTIM_HandleTypeDef *hlptim);

/* MSP functions  *************************************************************/
void HAL_LPTIM_MspInit(LPTIM_HandleTypeDef *hlptim);
void HAL_LPTIM_MspDeInit(LPTIM_HandleTypeDef *hlptim);
/**
  * @}
  */

/** @addtogroup LPTIM_Exported_Functions_Group2
  *  @brief   Start-Stop operation functions.
  * @{
  */
/* Config functions  **********************************************************/
HAL_StatusTypeDef HAL_LPTIM_OC_ConfigChannel(LPTIM_HandleTypeDef *hlptim, const LPTIM_OC_ConfigTypeDef *sConfig,
                                             uint32_t Channel);

/* Start/Stop operation functions  *********************************************/
/* ################################# PWM Mode ################################*/
/* Blocking mode: Polling */
HAL_StatusTypeDef HAL_LPTIM_PWM_Start(LPTIM_HandleTypeDef *hlptim, uint32_t Channel);
HAL_StatusTypeDef HAL_LPTIM_PWM_Stop(LPTIM_HandleTypeDef *hlptim, uint32_t Channel);
/* Non-Blocking mode: Interrupt */
HAL_StatusTypeDef HAL_LPTIM_PWM_Start_IT(LPTIM_HandleTypeDef *hlptim, uint32_t Channel);
HAL_StatusTypeDef HAL_LPTIM_PWM_Stop_IT(LPTIM_HandleTypeDef *hlptim, uint32_t Channel);
HAL_StatusTypeDef HAL_LPTIM_PWM_Start_DMA(LPTIM_HandleTypeDef *hlptim, uint32_t Channel, const uint32_t *pData,
                                          uint32_t Length);
HAL_StatusTypeDef HAL_LPTIM_PWM_Stop_DMA(LPTIM_HandleTypeDef *hlptim, uint32_t Channel);

/* ############################# One Pulse Mode ##############################*/
/* Blocking mode: Polling */
HAL_StatusTypeDef HAL_LPTIM_OnePulse_Start(LPTIM_HandleTypeDef *hlptim, uint32_t Channel);
HAL_StatusTypeDef HAL_LPTIM_OnePulse_Stop(LPTIM_HandleTypeDef *hlptim, uint32_t Channel);
/* Non-Blocking mode: Interrupt */
HAL_StatusTypeDef HAL_LPTIM_OnePulse_Start_IT(LPTIM_HandleTypeDef *hlptim, uint32_t Channel);
HAL_StatusTypeDef HAL_LPTIM_OnePulse_Stop_IT(LPTIM_HandleTypeDef *hlptim, uint32_t Channel);

